Revit 2026 API

# DWFImportOptionsSetSheetViews Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSheetViews(
	IList<ElementId> sheetViews
)
```
```vb
Public Sub SetSheetViews (
	sheetViews As IList(Of ElementId)
)
```
```cpp
public:
void SetSheetViews(
	IList<ElementId^>^ sheetViews
)
```
```fsharp
member SetSheetViews :
        sheetViews : IList<ElementId> -> unit
```

#### Parameters

sheetViews IListElementId

#### Reference

DWFImportOptions Class

Autodesk.Revit.DB Namespace